RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN236/MCXN236/drivers/fsl_lpuart.h
    kLPUART_AllClearFlags =
#if defined(FSL_FEATURE_LPUART_HAS_MCR) && FSL_FEATURE_LPUART_HAS_MCR
        kLPUART_CtsStateChangeFlag | kLPUART_DsrStateChangeFlag | kLPUART_RinStateChangeFlag |
        kLPUART_DcdStateChangeFlag |
#endif
        kLPUART_ParityErrorFlag | kLPUART_FramingErrorFlag | kLPUART_NoiseErrorFlag | kLPUART_RxOverrunFlag |
        kLPUART_IdleLineFlag | kLPUART_RxActiveEdgeFlag
#if defined(FSL_FEATURE_LPUART_HAS_FIFO) && FSL_FEATURE_LPUART_HAS_FIFO
        | kLPUART_TxFifoOverflowFlag | kLPUART_RxFifoUnderflowFlag
#endif
#if defined(FSL_FEATURE_LPUART_HAS_ADDRESS_MATCHING) && FSL_FEATURE_LPUART_HAS_ADDRESS_MATCHING
        | kLPUART_DataMatch2Flag | kLPUART_DataMatch1Flag
#endif
#if defined(FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT) && FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT
        | kLPUART_LinBreakFlag
#endif
    ,

    kLPUART_AllFlags =
#if defined(FSL_FEATURE_LPUART_HAS_MCR) && FSL_FEATURE_LPUART_HAS_MCR
        kLPUART_CtsStateChangeFlag | kLPUART_DsrStateChangeFlag | kLPUART_RinStateChangeFlag |
        kLPUART_DcdStateChangeFlag |
#endif
        kLPUART_ParityErrorFlag | kLPUART_FramingErrorFlag | kLPUART_NoiseErrorFlag | kLPUART_RxOverrunFlag |
        kLPUART_IdleLineFlag | kLPUART_RxDataRegFullFlag | kLPUART_TransmissionCompleteFlag |
        kLPUART_TxDataRegEmptyFlag | kLPUART_RxActiveFlag | kLPUART_RxActiveEdgeFlag
#if defined(FSL_FEATURE_LPUART_HAS_FIFO) && FSL_FEATURE_LPUART_HAS_FIFO
        | kLPUART_TxFifoOverflowFlag | kLPUART_RxFifoUnderflowFlag | kLPUART_TxFifoEmptyFlag | kLPUART_RxFifoEmptyFlag
#endif
#if defined(FSL_FEATURE_LPUART_HAS_ADDRESS_MATCHING) && FSL_FEATURE_LPUART_HAS_ADDRESS_MATCHING
        | kLPUART_DataMatch2Flag | kLPUART_DataMatch1Flag
#endif
#if defined(FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT) && FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT
        | kLPUART_LinBreakFlag
#endif
    ,
};

/*! @brief LPUART timeout condition.
 * This structure defines the conditions when the counter timeout occur.
 */
typedef enum _lpuart_timeout_condition
{
    kLPUART_TimeoutAfterCharacters =
        0U, /*!< Timeout occurs when the number of characters specified by timeoutValue are received. */
    kLPUART_TimeoutAfterIdle = 1U, /*!< Timeout occurs when rx/tx remains idle for timeoutValue of bit clocks after idle
                                      condition is detected. */
    kLPUART_TimeoutAfterNext = 2U, /*!< Timeout occurs when rx/tx remains idle for timeoutValue of bit clocks after next
                                      character is received/transmitted. */
    kLPUART_TimeoutAfterIdleBeforeExtended = 3U, /*!< Timeout occurs when tx/rx is idle for larger than timeoutValue of
                                                    bit clocks and smaller than tx/rx extended timeout value. */
} lpuart_timeout_condition_t;

/*! @brief LPUART timeout counter configuration structure. */
typedef struct _lpuart_timeout_counter_config
{
    bool enableCounter;                          /*!< Eneble the timeout counter. */
    lpuart_timeout_condition_t timeoutCondition; /*!< Timeout condition. */
    uint16_t timeoutValue;                       /*!< Timeout value. */
} lpuart_timeout_counter_config_t;

/*! @brief LPUART timeout configuration structure. */
typedef struct _lpuart_timeout_config
{
    uint16_t rxExtendedTimeoutValue;            /*!< The number of bits since the last stop bit that is required for an
                  idle condition to be detected. Enable this will disable rxIdleType and rxIdleConfig. Set to 0 to disable. */
    uint16_t txExtendedTimeoutValue;            /*!< The transmitter idle time in number of bits (baud rate) whenever an 
                  idle character is queued through the transmit FIFO. */
    lpuart_timeout_counter_config_t rxCounter0; /*!< Rx counter 0 configuration. */
    lpuart_timeout_counter_config_t rxCounter1; /*!< Rx counter 1 configuration. */
    lpuart_timeout_counter_config_t txCounter0; /*!< Tx counter 0 configuration. */
    lpuart_timeout_counter_config_t txCounter1; /*!< Tx counter 1 configuration. */
} lpuart_timeout_config_t;

/*! @brief LPUART configuration structure. */
typedef struct _lpuart_config
{
    uint32_t baudRate_Bps;            /*!< LPUART baud rate  */
    lpuart_parity_mode_t parityMode;  /*!< Parity mode, disabled (default), even, odd */
    lpuart_data_bits_t dataBitsCount; /*!< Data bits count, eight (default), seven */
    bool isMsb;                       /*!< Data bits order, LSB (default), MSB */
#if defined(FSL_FEATURE_LPUART_HAS_STOP_BIT_CONFIG_SUPPORT) && FSL_FEATURE_LPUART_HAS_STOP_BIT_CONFIG_SUPPORT
    lpuart_stop_bit_count_t stopBitCount; /*!< Number of stop bits, 1 stop bit (default) or 2 stop bits  */
#endif
#if defined(FSL_FEATURE_LPUART_HAS_FIFO) && FSL_FEATURE_LPUART_HAS_FIFO
    uint8_t txFifoWatermark; /*!< TX FIFO watermark */
    uint8_t rxFifoWatermark; /*!< RX FIFO watermark */
#endif
#if defined(FSL_FEATURE_LPUART_HAS_MODEM_SUPPORT) && FSL_FEATURE_LPUART_HAS_MODEM_SUPPORT
    bool enableRxRTS;                         /*!< RX RTS enable */
    bool enableTxCTS;                         /*!< TX CTS enable */
    lpuart_transmit_cts_source_t txCtsSource; /*!< TX CTS source */
    lpuart_transmit_cts_config_t txCtsConfig; /*!< TX CTS configure */
#endif
    lpuart_idle_type_select_t rxIdleType;  /*!< RX IDLE type. */
    lpuart_idle_config_t rxIdleConfig;     /*!< RX IDLE configuration. */
    lpuart_timeout_config_t timeoutConfig; /*!< Timeout configuration. */
    bool enableSingleWire; /*!< Use TXD pin as the source for the receiver. When enabled the TXD pin should be
                              configured as open drain. */
    uint8_t rtsDelay;      /*!< Delay the negation of RTS by the configured number of bit clocks. */
    bool enableTx;         /*!< Enable TX */
    bool enableRx;         /*!< Enable RX */
} lpuart_config_t;

/*! @brief LPUART transfer structure. */
typedef struct _lpuart_transfer
{
    /*
     * Use separate TX and RX data pointer, because TX data is const data.
     * The member data is kept for backward compatibility.
     */
    union
    {
        uint8_t *data;         /*!< The buffer of data to be transfer.*/
        uint8_t *rxData;       /*!< The buffer to receive data. */
        const uint8_t *txData; /*!< The buffer of data to be sent. */
    };
    size_t dataSize; /*!< The byte count to be transfer. */
} lpuart_transfer_t;

